phpp01/prvn/objects_apg/dt-payroll-svc-feature-intg-postgres-run-trunc-limit/test/overwatch-test/src/test/java/com/intuit/psp/karate/tests/qbdtwsadapter/request_prd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.qbdtws.adapters.psp.payroll.sbd.intuit.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:QueryPaymentStatus>
            <!--Optional:-->
            <QueryBillPaymentStatusRequest>
                <PIN>632004976</PIN>
                <PSID>Test1234</PSID>
                <!--Optional:-->
                <BillPaymentIds>
                    <!--Zero or more repetitions:-->
                    <BillPaymentId>NA</BillPaymentId>
                </BillPaymentIds>
            </QueryBillPaymentStatusRequest>
        </web:QueryPaymentStatus>
    </soapenv:Body>
</soapenv:Envelope>